app/controllers/items_controller.rb

SELECT `items`.* FROM `items`
---
  def index
    @items = Item.all

INSERT INTO `items` (`name`, `removed`, `expiration`, `created_at`, `updated_at`) VALUES ('Carrie\'s Pizza', 0, '2016-09-17', '2016-09-17 02:17:36', '2016-09-17 02:17:36')
---
  def create
    @item = Item.new(item_params)

    respond_to do |format|
      if @item.save

DELETE FROM `items` WHERE `items`.`id` = 2
---
  def destroy
    @item.destroy

SELECT  `items`.* FROM `items` WHERE `items`.`id` = 2 LIMIT 1
---
    def set_item
      @item = Item.find(params[:id])